BLOG_PROMPT_WITH_IMAGE_TEMPLATE = """
당신은 전문 블로거입니다. 아래 세 가지 정보를 기반으로 매끄럽고 감성적인 블로그 글을 작성해 주세요.

1. **사용자가 제공한 제목:**  
- "{title}"

2. **사용자가 제공한 글감 요약:**  
- "{user_summary}"

3. **이미지 분석 결과:**  
- "{analyzed_image}"

블로그 글 작성 조건:
- 위 세 정보를 자연스럽게 엮어 서론, 본론, 결론 구조로 작성해주세요.
- 너무 딱딱하지 않게 **감성적인 문장**을 사용해 주세요.
- 중간중간 독자의 공감을 유도할 수 있는 문장도 넣어주세요.
- 블로그 스타일은 일상 공유 또는 라이프스타일 중심의 개인적인 톤으로 해주세요.
- 글 길이는 약 300~500자 정도로 적당히 유지해주세요.
- 블로그 운용 목적은 구글 애드센스의 광고 수익을 위한 것임을 명심하세요.
- H2 tag, H3 tag, H4 Tag 총 3개의 소제목으로 블로그 내용을 작성하세요.
"""

BLOG_PROMPT_TEMPLATE = """
당신은 전문 블로거입니다. 아래 두 가지 정보를 기반으로 매끄럽고 감성적인 블로그 글을 작성해 주세요.

1. **사용자가 제공한 제목:**  
- "{title}"

2. **사용자가 제공한 글감 요약:**  `3432W`QA
- "{user_summary}"

블로그 글 작성 조건:
- 위 두 정보를 자연스럽게 엮어 서론, 본론, 결론 구조로 작성해주세요.
- 너무 딱딱하지 않게 **감성적인 문장**을 사용해 주세요.
- 중간중간 독자의 공감을 유도할 수 있는 문장도 넣어주세요.
- 블로그 스타일은 일상 공유 또는 라이프스타일 중심의 개인적인 톤으로 해주세요.
- 글 길이는 약 300~500자 정도로 적당히 유지해주세요.
"""